/*
    task-countdown
    Напишите функцию getCountdown(futureDate), которая принимает дату в будущем
    и возвращает объект с оставшимся временем:

    {
        days: 2,
        hours: 5,
        minutes: 14,
        seconds: 33
    }

    Если дата уже прошла — вернуть объект с нулями:
    { days: 0, hours: 0, minutes: 0, seconds: 0 }

    Подсказки:
    - разница в миллисекундах: futureDate - Date.now()
    - в сутках 24 часа, в часе 60 минут, в минуте 60 секунд
    - для "извлечения" остатка используйте оператор % (остаток от деления)
    - значения должны быть целыми (Math.floor)
*/

export const getCountdown = (futureDate) => {

}
